import FeatureCard from "./FeatureCard";
import eyal from "../../../assets/WhatWeDo/eyal4.jpg";
import alex from "../../../assets/WhatWeDo/alex.jpg";
import teddy from "../../../assets/WhatWeDo/teddy.jpg";
import anat from "../../../assets/WhatWeDo/anat.jpg";
import racheli from "../../../assets/WhatWeDo/Racheli.jpg";
import ada from "../../../assets/WhatWeDo/ada.jpg";




const Featured = () => {

  const anatText = [
    "”?המורה, את יכולה לכתוב לי מכתב לאבא שלי”",
    "”?לא עדיף להתקשר אליו”",
    ".תיארתי לעצמי שהוא בחו”ל",
    ":ואז, בקול מהוסס היא לחשה",
    "“אבא שלי בבית סוהר”",
    ",לפני מספר שנים, בסיום יום הלימודים, עוד אני מארגנת את הציוד שלי",
    ".התקרבה אליי תלמידה ופניה מעידים על תחושה של אי נעימות",
    ".הייתה זו תלמידה ביישנית שלא התבלטה כלל על אף היותה ילדה נבונה היא חששה לשתף",
    "היא ביקשה ממני לכתוב מכתב לאביה ובפנים נבוכות שיתפה",
    ".כי הוא אסיר המרצה את עונשו כבר שנה וכי לא ראתה אותו בכל פרק הזמן הזה",
    ".את התלמידה הזו הייתה מביאה בבוקר ואוספת בתום יום הלימודים אמא שלה.",
    ".את האבא לא ראיתי מעולם. עכשיו הכל מובן",
    ".היה לי ברור שאסייע לה לכתוב ולשתף אותו בכל שרצתה",
    ".וככה מידי שבוע, היא הייתה מגיעה עם מכתב שקיבלה מאביה ויחד היינו כותבות לו תשובה",
    ".לרוב הייתה גם מצרפת ציור או מבחן עם ציון גבוה שרצתה להציג בפניו",
    "כעבור חצי שנה, בעת יציאתי מבית הספר, פנה אליי בחור צעיר ושאל אם אני ענת",
    "?כן, עניתי. ומי אתה",
    ".אני אבא של...., האסיר",
    ".השתחררתי היום ובאתי להגיד לך תודה",
    ".הוא שיתף כי בזכות המכתבים התחיל תהליך שיקום ואף קיבל קיצור מהמאסר",
    ".התרגשתי מאוד, הודיתי לו על השיתוף והוספתי שהבת שלו יזמה ואני רק השותפה",
    ".המפגש הזה הותיר בי את חותמו",
    ".ידעתי שאסיים את לימודי הטיפול, ארצה להתנדב ולסייע לאסירים שהם הורים לילדים",
    ".“ואכן, היום אני לוקחת חלק בפרוייקט “בגובה העיניים",
    ".התברכנו לקבל את ענת כמנטורית בתכנית “בגובה העיניים” של העמותה",
    "האנרגיות, החום, החיוניות שהיא משדרת למלווים שלנו יחד עם מקצועיות ודיוק",
    ".ראויים לציון לשבח ותורמים משמעותית להשתלבות המוצלחת בחברה",
  ];

  const gidiText = [
    ",“סיפורו של גידי הוא “גדול מהחיים",
    ".ולא בכדי פרק מכריע בחייו הפך לסרט פולחן ישראלי",
    ".הוא נולד באפריקה לאם יהודיה ולאב שהיה ראש שבט מקומי ודמות משפיעה בזירה הציבורית",
    "במהלך מלחמת אזרחים אכזרית, אביו נפטר ואמו החליטה",
    ".לחזור למשפחתה בחבר העמים המתפרק, עם 2 ילדיה הרכים",
    ".אפשר להוציא אדם מאפריקה, אבל אי אפשר לעקור אפריקה מלבו",
    ".בגיל העשרה, גידי עלה ארצה בגפו כדי להיות לוחם בצהל, ושירת בחטיבת גולני",
    ",תמיד חלם לחזור לאפריקה כדי להילחם לטובת צדק חברתי",
    "להקים קיבוץ ולהפוך חיים של עוני וניצול בקרב הנטיבס לחיים של עצמאות",
    ".כלכלית תוך כדי שמירה על אורח חיים שיתופי בר-קיימא",
    ".בארץ החלום התנפץ, חייו הסתבכו, וגידי הגיע אלינו אחרי מאסרו השני",
    ",חלק משמעותי בתהליך שהוא עבר אצלנו התמקד בחיבור לשורשיו ולזהותו המורכבת",
    ".בקבלתו את השוני של עצמו תוך כדי מאמץ הסתגלות למדינה מערבית",
    "סיפור החיים של הנשיא ברק אובמה הפך למקור השראה",
    ".ולכלי טיפולי-שיקומי שהעניק לו אומץ לקבל החלטות לא שגרתיות",
    ",במילים שלו: “לאחר שלא חשבתי שחיי יכולים להשתנות",
    "מתחילה לנבוט בי התקווה כי הנה אני יוצא לא רק מחשכת הכלא שבו הייתי",
    "...אלה מן האופל הנורא כולו שאפף את חיי סוף סוף",
    ".אני יוצא מאפילה לאור גדול וזוהי יציאת מצרים הפרטית שלי",
    "גידי המחיש באופן מובהק את הבדידות ואת האתגרים הבלתי פוסקים של אדם",
    ".ללא משפחה קרובה שחוזר לחברה אחרי ריצוי מאסר",
    ",הוא תמיד חוזר אלינו בצמתים מורכבים בחייו הצבעוניים והמפותלים",
    ".כי הקשר בייננו הוא חיבור לחיים"
  ];

  const eyalText = [
    ".“אייל עושה הכל “בגדול",
    ";כבר במפגשנו הראשון בשלהי מאסרו, ידענו שיש לו קסם מיוחד וכללים משלו",
    ".וגם משפחה חמה שתמיד עמדה לצידו ותמכה, בטוב וברע",
    ".זמן קצר אחרי השחרור, האומץ של אייל הרשים אותנו",
    ".הוא ניגש ללשכתו של ראש העיר בה הוא מתגורר ושפך את ליבו",
    ".“אני אסיר משוחרר“ הוא הצהיר. “לא ביקשתי טובות אי-פעם. אני לא רוצה לחזור לכלא“",
    "“?בתי התארסה, וחשוב לי להיות אבא טוב. אני זקוק לעבודה, האם תוכל לעזור לי“",
    ",אני רוצה לתת לך הזדמנות“ השיב ראש העיר, בלי להחסיר פעימה“",
    "“.אבל קודם אני רוצה לבחון שאתה רציני“",
    ".כעבור מספר ימים, אייל השתלב בעבודה במסגרת העירייה, ונדרש להתייצב ב-4:30 מידי יום",
    ",לא היה קל להירתם לעבודה “מסודרת“ בה הזמן אינו בידיו",
    ",אבל הוא החזיק מעמד עם חיוך נסוך על פניו, בהומור,",
    ".מלא תקווה ובטוח שזה המבוא לעבודה שהוא באמת רוצה",
    ".אחרי חצי שנה בה הוא “הוכיח את עצמו“ אייל הצליח להגשים את חלומו, ופתח עסק משלו",
    "הוא בעל ניסיון בענף המסעדנות, תחום שדורש השקעה אינטנסיבית",
    ",עם סיכון גבוה ולא פחות חשוב, לאהוב אנשים. אייל לא פוחד לעבוד",
    ",וכל המשפחה נרתמה למימוש החזון שלו במו ידיו",
    ".הוא פתח פוד-טראק שמיד זכה לביקורות מעולות והרבה לקוחות מרוצים",
    ",למרות המלחמה. בתקופה בה הרבה עסקים מתקפלים",
    ".אייל עומד להתרחב ולפתוח עוד עסקים בתחום המזון",
    ".לאורך כל הדרך, ענת, המנטורית לחיים, ומוטי, המנטור העסקי, עומדים לצידו",
    "הם נהנים מהשגשוג היוצא דופן של אייל, דבר שמחמם את הלב ומוכיח",
    ".“ש“אתה לא יכול לשנות את הקלפים שחילקו לך, אבל אתה יכול לשחק איתם חכם"
  ];

  const alexText = [
    ".אלכס הגיע ארצה בשיא העלייה מחבר העמים המתפרק",
    ",אף על פי שהוא אדם חרוץ ועצמאי שמפרנס את עצמו מגיל צעיר",
    ",השתלבותו בחברה הישראלית לא הייתה קלה בעליל, וכעבור תקופה קצרה",
    ".הוא מצא את עצמו מאחורי סורג ובריח, שפוט למאסר ארוך",
    ".קליטתו לתרבות, לשפה ולאורח החיים הישראלי התבצעה בתנאי כליאה",
    ",בשנים הראשונות, הוא חשב שעתידו להיקבר בכלא",
    ".ושרד ללא תקווה וללא אופק, באגפים בהם משולבים עבריינים קשים",
    ",עם הזמן, חשיבתו עברה מפנה כאשר הבין שיום אחד, לא רחוק מידי",
    ".הוא יחזור לחיים כאדם חופשי, ויצטרך לקחת אחריות על קיומו",
    ".היכולת לדמיין חיים אחרים מחוץ כותלי הכלא נתנה לאלכס כוח ותקווה",
    ",קבלתו ל“רדיו פוקוס“, הרדיו של האסירים המשדרת בתוך כותלי הכלא",
    ",הניעה את השינוי הכי משמעותי במאסרו. כשדרן ועורך תוכן, הוא התחיל לפרוח",
    ",תוך כדי עבודה בשלוש משרות. יזם בנשמתו, אלכס יצר תכנית רדיו לאסירים דוברי רוסית",
    ".מילה חדשה אחת בעברית“ מידי יום, בנוסף, תכנית של מוזיקה משנות ה-60 ודברים אחרים“",
    ",בפגישתנו הראשונה כשבוע אחרי השחרור, ראינו אדם מפוחד וקצת מבולבל, ויחד עם זאת",
    ".ידענו שהוא יצליח, אפילו בגדול, אף על פי שאין לו אף אחד בארץ",
    "אלכס השתחרר עם חסכונות, דבר נדיר בקרב אסירים, והסכום המכובד נתן לו חמצן לחודשים הראשונים כאזרח מן השורה. תמיד אופטימי עם חיוך חם, אלכס דוגל לראות את הפן החיובי בכל התרחשות בחייו. אנו זוכרים באהדה את התרגשותו בביקור הראשון ב“מק דונלדס“, בקניות בחנויות “3 ב-10 שח“ (כמה דברים אפשר לקנות ב10 שקלים!!!)",
    " - התלהבותו מרכיבת על אופניים על שפת הים ",
    ";הרכישה החשובה הראשונה אחרי קבלתו לעבודה",
    ",והדמעות כשקיבל אישור להשתתף ב“סופש כיף“ עם צוות החברה בה הוא עובד",
    ",החופשה הראשונה בחייו. לאורך כל הדרך, מוטי, המנטור האולטימטיבי שלנו",
    ".שימש עבורו סביבה תומכת, אוזן קשבת, יד מכוונת ושותף שאין כדוגמתו",
    ".ביניהם צמחה חברות לחיים נדירה יש לאלכס חלום שעדיין לא התממש: להיות שדרן ברדיו",
    ",עם הפרגמטיות שמאפיין אותו, אלכס מבין שלא יוכל להתפרנס מעבודה בתחנת רדיו",
    "אך עדיין מחכה להזדמנות הנכונה להשמיע את קולו",
    "“.של תקווה ואמונה ש“השמיים הם רק ההתחלה",
  ];

  const racheliText = [
    "“,אני אישה מאוד סקרנית, אוהבת לשאול שאלות עומק, ואני מאוד מאמינה באנשים“",
    ".מספרת רחלי, פורצת דרך במנטורינג לאנשים שחצו כמה קווים אדומים בחייהם",
    "“המשפט שמלווה אותי - וזאת מסורת משפחתית“ - “אם תרצי, זה יהיה“",
    "“.ואם מישהו אחר הצליח, גם אני אצליח“",
    ",“וגם הבן אדם העומד מולי, שאני עמו בשיח. אנשים עשו דברים שהובילו אותם למאסר“",
    ".“אבל משם, אפשר גם לצמוח“",
    ",כשפורסם הק”ק [גיוס מנטורים לאנשים שחוזרים לחברה אחרי ריצוי מאסר]",
    ".אמרתי “הנני, אני באה“, נרשמתי אף על פי שלא הבנתי לאן זה יוביל",
    ".לא חשבתי אפילו לרגע שלא נצליח [המלווה ואני]",
    ",רחלי חברה ותיקה בקיבוץ במקום הכי צפוני בארץ, ולמרות המרחק",
    ".תמיד הגיע להכשרות במרכז וגם למפגשים של קבוצת המנטורים",
    "“.אני לא באתי עם פנטזיות של להציל אנשים, אם צפיות מאחרים -- רק מעצמי",
    ",אני מאוד עקשנית, מתמידה ומחויבת למה שאני בוחרת לעשות. וזה עניין חשוב במנטורינג",
    ".אתה צריך להיות מאוד מאורגן ולקבוע מטרות כדי ליצור את הזמינות הנדרשת",
    ".“וגם לשמור על הנאה מהתפקיד, לא לפעול רק מתחושה שאני “חייבת",
    ".אנחנו יכולים להוסיף בביטחון, זה משפיע לטובה גם על המלווים של רחלי",
    ",התמיכה ב-100% של בן הזוג שלי מאוד חשובה. הוא, כמוני“",
    "“.מאמין בשליחות ובתרומה למדינה בה אנו חיים. אני חושבת שזה מאוד מחלחל לבנות שלי",
    "“.וגם הוריי התנדבו, זה חלק מהעברת הערכים לדור הבא”",
    ",לבנות שלי היה מאוד קשה להכיל את העובדה שהמלווה שלי ישבה על עבירה קשה“",
    ".דבר שסיפרתי להן רק אחרי שנים במסע הליווי שלי. “את לא פוחדת?!“, שאלו אותי בשוק",
    "“.והשבתי, “לא אני לא פוחדת, כי אני סומכת עליה ועל עצמי",
    "בפגישה הראשונה שלי עם המלווה ראיתי בעיניים שלה שהיא באמת רוצה לחזור למוטב ולהשתקם",
    ".רחלי זכתה לחוות את התוצאות המרשימות של האימון ושל ההשקעה שלה באנשים",
    ".היא חוותה את הצמיחה, השינוי מייאוש ומיינדסט פטליסטי לתפיסה פרואקטיבית ומעצימה",
    ",החיים של המלווים שלה עדיין לא קלים",
    ".אבל אין ספק שהדרך שהם עשו מחזקת את התקווה ואת האמונה בתהליך המנטורינג",
    ":המסר של רחלי למי ששוקל לשמש מנטור בתכנית “בגובה העיניים” שלנו",
    ",כולנו לא מושלמים לכול אדם יש נפילות“",
    "[אכן המסורת שלנו גורסת: “כִּי אָדָם אֵין צַדִּיק בָּאָרֶץ אֲשֶׁר יַעֲשֶׂה טּוֹב וְלֹא יֶחֱטָא“ קהלת 20:7]",
    "“.העולם לא מושלם, וגם לא יהיה. החברה שלנו מורכבת מאנשים שונים, וזאת היופי שלה",
    ".תמיד יהיה פשע, אבל מי אני שלא אתן למי שרוצה אפשרות להשתלב בחברה, לחזור למוטב",
    ".מנטורינג דורש הרתמה מוחלטת והיכולת לתת אימון במיוחד לאנשים שאין להם אימון בעצמם",
    "“.אם נשנה את הדרך בה אנו “רואים“ מי שחוזר לחברה אחרי מאסר גם העולם הסובב אותנו ישתנה“",
  ];

  const adaText = [
    ".עדה יודעת על בשרה את משמעות החיים בצל פשע ובתי סוהר",
    ",היא מביאה לעבודתה כמנטורית את קולם של ילדי האסירים",
    ".המשלמים מחיר כבד על מעשי ההורים על לא עוול בכפיהם",
    ".עדה הייתה ילדה קטנה כשאביה נכנס למאסרו הראשון",
    ",הוא היה אדם כריזמטי, סמכותי ואכזרי שהפך התנהגות עבריינית לקריירה סדורה",
    ".ולימים היה “בורר” שדעתו מוערכת וקובעת עמדות בעולם התחתון",
    ".שהייתו בכלא, בפעימות שונות, הצטברה לכ-20 שנה",
    ",כשאביה היה בבית “בין לבין“, כל המשפחה הייתה בחרדה, אבל כשהוא חזר לכלא, עדה התגעגעה אליו",
    ",וכתבה למפקד בית הסוהר בנוקשות ובעקביות כדי לבקש תנאים משופרים עבורו",
    ".ביקורים בתדירות גבוהה יותר, וגם כדי שהוא יעביר לאבא מתנות קטנות",
    ",הילדה שפונה בדרישות למפקד בית סוהר סקרנה אותו",
    ".ובאחד הביקורים הוא הגיע להכיר את ה”חוצפנית” שלא פחדה להשמיע את קולה",
    ".ולדרוש מה שהיא חושבת מגיע לה ולאביה",
    ",בשלב מסוים, מתוך פחד שבפעם הבאה אולי במקום תא בכלא הוא ישכב בקבר",
    ".אביה של עדה החליט לעזוב את עולם הפשע",
    ",בהמלצת המשטרה, הוא עבר למדינה אחרת, לבדו",
    ",ועדה שוב מצאה את עצמה מתגעגעת אליו ולחיי משפחה שקטים ומסודרים",
    ".חלום שהתנפץ שוב ושוב במבחן המציאות",
    ",בגיל צעיר עדה התחתנה עם אדם אכזרי ומניפולטיבי שאביה הכירה לה",
    ".ניהלה חיים של סבל וניצול, והתדרדרה להתמכרויות",
    ".רק אחרי תקרית על סף מוות היא אזרה אומץ ובחרה בחיים",
    ".לאט לאט, עדה התחילה לבנות את עצמה ואת זהותה מחדש",
    ",אחרי מסע מטלטל, עדה מצא את הכוח “לסלוח” לאביה",
    ";שחזר ארצה והמשיך להתפרנס מעסקים “לגיטימיים”, והיום מתגורר לידה",
    ",וסגרה חשבון גם עם עצמה. אחרי תהליך ארוך של התחזקות, עצמאות ופריחה",
    ",עדה החליטה להשלים את המעגל, והבינה שסיפורה האישי כילדה של אסיר שעשה שינוי דרמטי בחייו",
    ".מהווה מקור של כח ואשראה, ויכול להאיר את דרכם של אבות שחוזרים למשפחותיהם אחרי ריצוי מאסר",
  ];




  const featuresData = [
    {
      id: 0,
      image: anat,
      text: anatText.map((paragraph, index) => <p key={index}>{paragraph}</p>),
      buttonLabel: 'הסיפור של ענת',
    },
  ];
  const featuresData1 = [
    {
      id: 1,
      image: teddy,
      text: gidiText.map((paragraph, index) => <p key={index}>{paragraph}</p>),
      buttonLabel: 'הסיפור של גידי',
    },
  ];

  const featuresData2 = [
    {
      id: 2,
      image: eyal,
      text: eyalText.map((paragraph, index) => <p key={index}>{paragraph}</p>),
      buttonLabel: 'הסיפור של אייל',
      position: 'top'
    },
  ];
  const featuresData3 = [
    {
      id: 3,
      image: alex,
      text: alexText.map((paragraph, index) => <p key={index}>{paragraph}</p>),
      buttonLabel: 'הסיפור של אלכס',
    },
  ];
  const featuresData4 = [
    {
      id: 4,
      image: racheli,
      text: racheliText.map((paragraph, index) => <p key={index}>{paragraph}</p>),
      buttonLabel: 'הסיפור של רחלי',
    },
  ];
  const featuresData5 = [
    {
      id: 5,
      image: ada,
      text: adaText.map((paragraph, index) => <p key={index}>{paragraph}</p>),
      buttonLabel: 'הסיפור של עדה',
    },
  ];


  return (
    <div className="container mt-36 mb-56">
      <h1 className="font-bold text-5xl text-center text-primary pb-10">
        הסיפורים<span className="text-tertiary"> שלנו</span>
      </h1>

      <div className="grid grid-cols-2 md:grid-cols-4 gap-4">

        <div className="grid gap-4 h-fit">
        <div>
           <div className="bg-primary h-32 rounded-lg"></div>
          </div>
          {featuresData1.map((item) => (
            <FeatureCard
              key={item.id}
              image={item.image}
              name={item.name}
              text={item.text}
              buttonLabel={item.buttonLabel}
            />
          ))}
          <div>
           <div className="bg-secondary h-44 rounded-lg"></div>
          </div>
          <div>
           <div className="bg-tertiary h-60 rounded-lg"></div>
          </div>
        </div>

        <div className="grid gap-4 h-fit">
        {featuresData2.map((item) => (
              <FeatureCard
                key={item.id}
                image={item.image}
                name={item.name}
                text={item.text}
                buttonLabel={item.buttonLabel}
              />
            ))}
          <div>
            {featuresData.map((item) => (
              <FeatureCard
                key={item.id}
                image={item.image}
                name={item.name}
                text={item.text}
                buttonLabel={item.buttonLabel}
              />
            ))}
          </div>
          <div>
           <div className="bg-primary h-44 rounded-lg"></div>
          </div>
        </div>

        <div className="grid gap-4 h-fit">
        {featuresData3.map((item) => (
              <FeatureCard
                key={item.id}
                image={item.image}
                name={item.name}
                text={item.text}
                buttonLabel={item.buttonLabel}
              />
            ))}
            {featuresData4.map((item) => (
              <FeatureCard
                key={item.id}
                image={item.image}
                name={item.name}
                text={item.text}
                buttonLabel={item.buttonLabel}
              />
            ))}
            <div>
           <div className="bg-secondary h-44 rounded-lg"></div>
          </div>
        </div>

        <div className="grid gap-4 h-fit">
        <div>
           <div className="bg-secondary h-32 rounded-lg"></div>
          </div>
        {featuresData5.map((item) => (
              <FeatureCard
                key={item.id}
                image={item.image}
                name={item.name}
                text={item.text}
                buttonLabel={item.buttonLabel}
              />
            ))}
       
          <div>
           <div className="bg-primary h-56 rounded-lg"></div>
          </div>
          <div>
           <div className="bg-tertiary h-48 rounded-lg"></div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Featured;


