import workmodel from '../../../assets/WhatWeDo/workmodel.jpg';

const AboutUs = () => {
    return (
        <div className="bg-primary w-full text-center h-full justify-center">
            <div className="text-xl lg:text-3xl md:text-3xl sm:text-3xl font-medium text-white pt-5">
                <p>.דמיינו עולם בו לא מגדירים אתכם ע”פ הטעות הכי חמורה שעשיתם בחיים</p>
                <p><b>.עולם בו  טעות היא גם הזדמנות לתיקון</b></p>
                <p>,עולם בו אם עשיתם טעות ו”שלמתם” עליו, אתם לא לבד,כי יש אנשים שמאמינים בכם</p>
                <p>.ומוכנים להושיט יד כדי לעזור לכם לפתוח <b>דף חדש. ללא שאלות. </b> כי זה הדבר הנכון</p>
                <br />
                <p>,אנו מאמינים במתן <b>הזדמנות שווה</b> ל”אזרחים חוזרים” אחרי ריצוי מאסר</p>
                <p>.”כי הם הרבה יותר מ”אסירים משוחררים</p>
                <p>,בעזרת תפיסת עבודה מבוססת <b>כוחות וגמישות מחשבתית</b></p>
                <p>.אנו מחברים אנשים לכוחות שלהם ולמשאבים, לכלים, להזדמנויות <b>ולמימוש זכויות</b> שיעזרו להם לצאת משולי החברה ולהצליח בחיים</p>
                <br />
                <p>.”המעבר מ”פלנטה הכלא” אל החופש עובר דרך ”<b>משבר השחרור</b></p>
                <p>:המשימה המרכזית שלנו היא חיזוק והשפעה על <b>החוסן</b> בכל ממדיו</p>
                <p>.תעסוקה ובטחון כלכלי, משפחה, הרחבה וחיזוק המשאבים האישיים והסביבה</p>
                <p>.המטרה היא להרחיב את אזורי <b>התפקוד, המסוגלות והתקווה</b> של כל מלווה בעמותה</p>
                <p>.הגברת החוסן והיכולת התפקודית מובילים <b>לשגרה חיונית</b> ובריאה, גורם מפתח <b>למניעת הרצידיביזם</b></p>
                <br />
                <p><b>,פרנסה ביושר</b>” שותפה <b>לאקו-סיסטם</b> הכולל מגוון רחב של גורמים בקהילה”</p>
                <p>.ופועלת במתכונת הוליסטית לקידום <b>סינרגיות</b> לעתיד איתן ובר-קיימא</p>
                <br />
                <p className="text-red-600 font-bold">
                    :ההצלחה שלהם, הרווח של כולנו
                </p>
                <br />
                <p className="text-red-600 font-bold">
                    כ-98% מהמלווים שלנו לא חזרו לכלא! לעומת כ-40% רצידיביזם ברמה ארצית
                </p>
                <p className="text-red-600 font-bold">
                    (ע”פ הנתונים של מבקר המדינה)
                </p>
                <p className="text-red-600 font-bold">
                    זכרו: אסיר במאסר עולה לחברה כ-240,000 ש”ח בשנה
                </p>
                <p className="text-red-600 font-bold">
                    (בלי להתחשב בעלויות נלוות אחרות: למשפחתו, לנפגעי עבירה ולחברה כולה)
                </p>
                <br />
                <p>היום שאחרי השחרור</p>
                <br />
                <p className="text-red-600 font-bold">
                    !מפחיד
                </p>
                <br />
                <p>,מחכים לשחרור עם געגוע ותשוקה</p>
                <br />
                <p>.אבל העולם ה”חופשי” מבלבל</p>
                <br />
                <p>,פרנסה ביושר”, הכל במקום אחד”</p>
                <br />
                <p>,יחס אישי, יש עם מי לדבר</p>
                <br />
                <p>.תמיכה הוליסטית שאינה מוגבלת בזמן</p>
                <div className="bg-no-repeat bg-contain bg-center h-96 mt-10" style={{ backgroundImage: `url(${workmodel})` }}>
                </div>
            </div>
        </div>
    )
}

export default AboutUs
